model {
  ssd {
    num_classes: 4
    image_resizer {
      fixed_shape_resizer {
        height: 300
        width: 300
      }
    }
    feature_extractor {
      type: "ssd_mobilenet_v2"
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 3.9999999e-05
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.029999999
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.99970001
          center: true
          scale: true
          epsilon: 0.001
          train: true
        }
      }
      use_depthwise: true
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 3.9999999e-05
            }
          }
          initializer {
            truncated_normal_initializer {
              mean: 0.0
              stddev: 0.029999999
            }
          }
          activation: RELU_6
          batch_norm {
            decay: 0.99970001
            center: true
            scale: true
            epsilon: 0.001
            train: true
          }
        }
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.80000001
        kernel_size: 3
        box_code_size: 4
        apply_sigmoid_to_scores: false
        use_depthwise: true
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.2
        max_scale: 0.94999999
        aspect_ratios: 0.40000001
        aspect_ratios: 0.60000002
        aspect_ratios: 1.0
        aspect_ratios: 0.75
        aspect_ratios: 1.3329999
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 9.9999999e-09
        iou_threshold: 0.60000002
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid {
        }
      }
      hard_example_miner {
        num_hard_examples: 3000
        iou_threshold: 0.99000001
        loss_type: CLASSIFICATION
        max_negatives_per_positive: 3
        min_negatives_per_image: 3
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
  }
}
train_config {
  batch_size: 32
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    ssd_random_crop {
    }
  }
  data_augmentation_options {
    random_adjust_brightness {
    }
  }
  data_augmentation_options {
    random_adjust_contrast {
    }
  }
  data_augmentation_options {
    random_adjust_saturation {
    }
  }
  optimizer {
    adam_optimizer {
      learning_rate {
        manual_step_learning_rate {
          initial_learning_rate: 0.0070000002
          schedule {
            step: 10000
            learning_rate: 9.9999997e-05
          }
          schedule {
            step: 25000
            learning_rate: 7.9999998e-05
          }
          schedule {
            step: 50000
            learning_rate: 3.9999999e-05
          }
        }
      }
    }
    use_moving_average: false
  }
  fine_tune_checkpoint: "/content/drive/My Drive/SMART_SCOOTER/ssdlite_mobilenet_v2_coco_2018_05_09/model.ckpt"
  from_detection_checkpoint: true
  num_steps: 200000
  fine_tune_checkpoint_type: "detection"
}
train_input_reader {
  label_map_path: "/content/drive/My Drive/SMART_SCOOTER/SmartScooter/TRAFFIC_LIGHTS/TL_W_COLORS/labelmap/TL.pbtxt"
  tf_record_input_reader {
    input_path: "/content/drive/My Drive/SMART_SCOOTER/record_files/TL/new_train.record"
  }
}
eval_config {
  num_examples: 566
  use_moving_averages: false
}
eval_input_reader {
  label_map_path: "/content/drive/My Drive/SMART_SCOOTER/SmartScooter/TRAFFIC_LIGHTS/TL_W_COLORS/labelmap/TL.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    input_path: "/content/drive/My Drive/SMART_SCOOTER/record_files/TL/new_test.record"
  }
}
